
## Plan Result (prod)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 9 to add, 1 to change, 9 to destroy.</code></pre>

* Update
  * module.servicebus-namespace.azurerm_servicebus_namespace.servicebus_namespace
* Replace
  * module.servicebus-queue-request.azurerm_servicebus_queue.servicebus_queue
  * module.servicebus-queue-request.azurerm_servicebus_queue_authorization_rule.listen_auth_rule
  * module.servicebus-queue-request.azurerm_servicebus_queue_authorization_rule.send_auth_rule
  * module.servicebus-queue-response.azurerm_servicebus_queue.servicebus_queue
  * module.servicebus-queue-response.azurerm_servicebus_queue_authorization_rule.listen_auth_rule
  * module.servicebus-queue-response.azurerm_servicebus_queue_authorization_rule.send_auth_rule
  * module.servicebus-subscription.azurerm_servicebus_subscription.servicebus_subscription
  * module.servicebus-topic.azurerm_servicebus_topic.servicebus_topic
  * module.servicebus-topic.azurerm_servicebus_topic_authorization_rule.send_listen_auth_rule
* Move
  * module.application_insights.azurerm_monitor_activity_log_alert.main => module.application_insights.azurerm_monitor_activity_log_alert.main[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.application_insights.azurerm_monitor_activity_log_alert.main has moved to module.application_insights.azurerm_monitor_activity_log_alert.main[0]
    resource "azurerm_monitor_activity_log_alert" "main" {
        id                  = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/hmc-shared-prod/providers/Microsoft.Insights/activityLogAlerts/Application Insights daily cap reached - hmc-prod"
        name                = "Application Insights daily cap reached - hmc-prod"
        tags                = {
            "application"         = "core-case-data"
            "builtFrom"           = "https://github.com/HMCTS/hmc-shared-infrastructure.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#ccd_support"
            "environment"         = "production"
            "managedBy"           = "CDM"
        }
        # (5 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.servicebus-namespace.azurerm_servicebus_namespace.servicebus_namespace will be updated in-place
  ~ resource "azurerm_servicebus_namespace" "servicebus_namespace" {
        id                                  = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/hmc-shared-prod/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-prod"
      ~ minimum_tls_version                 = "1.0" -> "1.2"
        name                                = "hmc-servicebus-prod"
        tags                                = {
            "Destroy Me"          = "No"
            "Team Contact"        = "#ccd-devops"
            "application"         = "core-case-data"
            "builtFrom"           = "https://github.com/HMCTS/hmc-shared-infrastructure.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#ccd_support"
            "environment"         = "production"
            "managedBy"           = "CDM"
        }
        # (12 unchanged attributes hidden)
    }

  # module.servicebus-queue-request.data.azurerm_servicebus_namespace.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_servicebus_namespace" "this" {
      + capacity                            = (known after apply)
      + default_primary_connection_string   = (sensitive value)
      + default_primary_key                 = (sensitive value)
      + default_secondary_connection_string = (sensitive value)
      + default_secondary_key               = (sensitive value)
      + endpoint                            = (known after apply)
      + id                                  = (known after apply)
      + location                            = (known after apply)
      + name                                = "hmc-servicebus-prod"
      + premium_messaging_partitions        = (known after apply)
      + resource_group_name                 = "hmc-shared-prod"
      + sku                                 = (known after apply)
      + tags                                = (known after apply)
    }

  # module.servicebus-queue-request.azurerm_servicebus_queue.servicebus_queue must be replaced
-/+ resource "azurerm_servicebus_queue" "servicebus_queue" {
      ~ id                                      = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/hmc-shared-prod/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-prod/queues/hmc-to-hmi-prod" -> (known after apply)
      ~ max_message_size_in_kilobytes           = 1024 -> (known after apply)
        name                                    = "hmc-to-hmi-prod"
      ~ namespace_id                            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/hmc-shared-prod/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-prod" # forces replacement -> (known after apply) # forces replacement
        # (13 unchanged attributes hidden)
    }

  # module.servicebus-queue-request.azurerm_servicebus_queue_authorization_rule.listen_auth_rule must be replaced
-/+ resource "azurerm_servicebus_queue_authorization_rule" "listen_auth_rule" {
      ~ id                                = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/hmc-shared-prod/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-prod/queues/hmc-to-hmi-prod/authorizationRules/ListenSharedAccessKey" -> (known after apply)
        name                              = "ListenSharedAccessKey"
      ~ primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      ~ primary_key                       = (sensitive value)
      ~ queue_id                          = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/hmc-shared-prod/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-prod/queues/hmc-to-hmi-prod" # forces replacement -> (known after apply) # forces replacement
      ~ secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      ~ secondary_key                     = (sensitive value)
        # (3 unchanged attributes hidden)
    }

  # module.servicebus-queue-request.azurerm_servicebus_queue_authorization_rule.send_auth_rule must be replaced
-/+ resource "azurerm_servicebus_queue_authorization_rule" "send_auth_rule" {
      ~ id                                = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/hmc-shared-prod/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-prod/queues/hmc-to-hmi-prod/authorizationRules/SendSharedAccessKey" -> (known after apply)
        name                              = "SendSharedAccessKey"
      ~ primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      ~ primary_key                       = (sensitive value)
      ~ queue_id                          = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/hmc-shared-prod/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-prod/queues/hmc-to-hmi-prod" # forces replacement -> (known after apply) # forces replacement
      ~ secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      ~ secondary_key                     = (sensitive value)
        # (3 unchanged attributes hidden)
    }

  # module.servicebus-queue-response.data.azurerm_servicebus_namespace.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_servicebus_namespace" "this" {
      + capacity                            = (known after apply)
      + default_primary_connection_string   = (sensitive value)
      + default_primary_key                 = (sensitive value)
      + default_secondary_connection_string = (sensitive value)
      + default_secondary_key               = (sensitive value)
      + endpoint                            = (known after apply)
      + id                                  = (known after apply)
      + location                            = (known after apply)
      + name                                = "hmc-servicebus-prod"
      + premium_messaging_partitions        = (known after apply)
      + resource_group_name                 = "hmc-shared-prod"
      + sku                                 = (known after apply)
      + tags                                = (known after apply)
    }

  # module.servicebus-queue-response.azurerm_servicebus_queue.servicebus_queue must be replaced
-/+ resource "azurerm_servicebus_queue" "servicebus_queue" {
      ~ id                                      = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/hmc-shared-prod/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-prod/queues/hmc-from-hmi-prod" -> (known after apply)
      ~ max_message_size_in_kilobytes           = 1024 -> (known after apply)
        name                                    = "hmc-from-hmi-prod"
      ~ namespace_id                            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/hmc-shared-prod/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-prod" # forces replacement -> (known after apply) # forces replacement
        # (13 unchanged attributes hidden)
    }

  # module.servicebus-queue-response.azurerm_servicebus_queue_authorization_rule.listen_auth_rule must be replaced
-/+ resource "azurerm_servicebus_queue_authorization_rule" "listen_auth_rule" {
      ~ id                                = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/hmc-shared-prod/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-prod/queues/hmc-from-hmi-prod/authorizationRules/ListenSharedAccessKey" -> (known after apply)
        name                              = "ListenSharedAccessKey"
      ~ primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      ~ primary_key                       = (sensitive value)
      ~ queue_id                          = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/hmc-shared-prod/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-prod/queues/hmc-from-hmi-prod" # forces replacement -> (known after apply) # forces replacement
      ~ secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      ~ secondary_key                     = (sensitive value)
        # (3 unchanged attributes hidden)
    }

  # module.servicebus-queue-response.azurerm_servicebus_queue_authorization_rule.send_auth_rule must be replaced
-/+ resource "azurerm_servicebus_queue_authorization_rule" "send_auth_rule" {
      ~ id                                = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/hmc-shared-prod/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-prod/queues/hmc-from-hmi-prod/authorizationRules/SendSharedAccessKey" -> (known after apply)
        name                              = "SendSharedAccessKey"
      ~ primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      ~ primary_key                       = (sensitive value)
      ~ queue_id                          = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/hmc-shared-prod/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-prod/queues/hmc-from-hmi-prod" # forces replacement -> (known after apply) # forces replacement
      ~ secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      ~ secondary_key                     = (sensitive value)
        # (3 unchanged attributes hidden)
    }

  # module.servicebus-subscription.data.azurerm_servicebus_topic.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_servicebus_topic" "this" {
      + auto_delete_on_idle                     = (known after apply)
      + default_message_ttl                     = (known after apply)
      + duplicate_detection_history_time_window = (known after apply)
      + enable_batched_operations               = (known after apply)
      + enable_express                          = (known after apply)
      + enable_partitioning                     = (known after apply)
      + id                                      = (known after apply)
      + max_size_in_megabytes                   = (known after apply)
      + name                                    = "hmc-to-cft-prod"
      + namespace_id                            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/hmc-shared-prod/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-prod"
      + requires_duplicate_detection            = (known after apply)
      + status                                  = (known after apply)
      + support_ordering                        = (known after apply)
    }

  # module.servicebus-subscription.azurerm_servicebus_subscription.servicebus_subscription must be replaced
-/+ resource "azurerm_servicebus_subscription" "servicebus_subscription" {
      ~ id                                        = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/hmc-shared-prod/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-prod/topics/hmc-to-cft-prod/subscriptions/hmc-subs-to-cft-prod" -> (known after apply)
        name                                      = "hmc-subs-to-cft-prod"
      ~ topic_id                                  = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/hmc-shared-prod/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-prod/topics/hmc-to-cft-prod" # forces replacement -> (known after apply) # forces replacement
        # (10 unchanged attributes hidden)
    }

  # module.servicebus-topic.data.azurerm_resource_group.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_resource_group" "this" {
      + id         = (known after apply)
      + location   = (known after apply)
      + managed_by = (known after apply)
      + name       = "hmc-shared-prod"
      + tags       = (known after apply)
    }

  # module.servicebus-topic.data.azurerm_servicebus_namespace.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_servicebus_namespace" "this" {
      + capacity                            = (known after apply)
      + default_primary_connection_string   = (sensitive value)
      + default_primary_key                 = (sensitive value)
      + default_secondary_connection_string = (sensitive value)
      + default_secondary_key               = (sensitive value)
      + endpoint                            = (known after apply)
      + id                                  = (known after apply)
      + location                            = (known after apply)
      + name                                = "hmc-servicebus-prod"
      + premium_messaging_partitions        = (known after apply)
      + resource_group_name                 = "hmc-shared-prod"
      + sku                                 = (known after apply)
      + tags                                = (known after apply)
    }

  # module.servicebus-topic.azurerm_servicebus_topic.servicebus_topic must be replaced
-/+ resource "azurerm_servicebus_topic" "servicebus_topic" {
      ~ id                                      = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/hmc-shared-prod/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-prod/topics/hmc-to-cft-prod" -> (known after apply)
      ~ max_message_size_in_kilobytes           = 1024 -> (known after apply)
        name                                    = "hmc-to-cft-prod"
      ~ namespace_id                            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/hmc-shared-prod/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-prod" # forces replacement -> (known after apply) # forces replacement
        # (10 unchanged attributes hidden)
    }

  # module.servicebus-topic.azurerm_servicebus_topic_authorization_rule.send_listen_auth_rule must be replaced
-/+ resource "azurerm_servicebus_topic_authorization_rule" "send_listen_auth_rule" {
      ~ id                                = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/hmc-shared-prod/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-prod/topics/hmc-to-cft-prod/authorizationRules/SendAndListenSharedAccessKey" -> (known after apply)
        name                              = "SendAndListenSharedAccessKey"
      ~ primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      ~ primary_key                       = (sensitive value)
      ~ secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      ~ secondary_key                     = (sensitive value)
      ~ topic_id                          = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/hmc-shared-prod/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-prod/topics/hmc-to-cft-prod" # forces replacement -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

Plan: 9 to add, 1 to change, 9 to destroy.
```

</details>


<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.application_insights.azurerm_application_insights.this has changed
  ~ resource "azurerm_application_insights" "this" {
      ~ connection_string                     = (sensitive value)
        id                                    = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/hmc-shared-prod/providers/Microsoft.Insights/components/hmc-prod"
        name                                  = "hmc-prod"
        tags                                  = {
            "application"         = "core-case-data"
            "builtFrom"           = "https://github.com/HMCTS/hmc-shared-infrastructure.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#ccd_support"
            "environment"         = "production"
            "managedBy"           = "CDM"
        }
        # (15 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":38,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->